phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libspi_n6.c
/*
 * Phoenix-RTOS
 *
 * Multidrv-lib: STM32N6 SPI driver
 *
 * Copyright 2018, 2020, 2025 Phoenix Systems
 * Author: Aleksander Kaminski, Daniel Sawka, Jacek Maksymowicz
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */


#include <sys/pwman.h>
#include <errno.h>
#include <stdint.h>
#include <byteswap.h>

#include "../common.h"
#include "libmulti/libdma.h"
#include "libmulti/libspi.h"
#include "../rcc.h"
#include "../stm32n6_regs.h"

#define MAX_SPI spi6

#define SR_TXC (1 << 12) /* TX FIFO empty */
#define SR_TXP (1 << 1)  /* TX FIFO not full */
#define SR_RXP (1 << 0)  /* RX FIFO not empty */


static const struct libspi_peripheralInfo {
	uintptr_t base;
	unsigned int dev;
	enum ipclks clksel;    /* Clock selector */
	enum clock_ids clksrc; /* ID of source clock */
} spiInfo[MAX_SPI - spi1 + 1] = {
	{ (uintptr_t)SPI1_BASE, pctl_spi1, pctl_ipclk_spi1sel, clkid_per },
	{ (uintptr_t)SPI2_BASE, pctl_spi2, pctl_ipclk_spi2sel, clkid_per },
	{ (uintptr_t)SPI3_BASE, pctl_spi3, pctl_ipclk_spi3sel, clkid_per },
	{ (uintptr_t)SPI4_BASE, pctl_spi4, pctl_ipclk_spi4sel, clkid_per },
	{ (uintptr_t)SPI5_BASE, pctl_spi5, pctl_ipclk_spi5sel, clkid_per },
	{ (uintptr_t)SPI6_BASE, pctl_spi6, pctl_ipclk_spi6sel, clkid_per },
};


int libspi_transaction(libspi_ctx_t *ctx, int dir, unsigned char cmd, unsigned int addr, unsigned char flags, unsigned char *ibuff, const unsigned char *obuff, size_t bufflen)
{
	unsigned int addrsz = (flags >> SPI_ADDRSHIFT) & SPI_ADDRMASK;
	unsigned int ignoreBytes = 0;

	/* Enable SPI */
	*(ctx->base + spi_cr1) |= 1;
	dataBarier();

	/* Send command, address and dummy bytes if requested.
	 * They can be sent all at once because FIFO is large enough (16 bytes) */
	if ((flags & spi_cmd) != 0) {
		*(ctx->base + spi_txdr) = cmd;
		ignoreBytes += 1;
	}

	if (addrsz > 0) {
		ignoreBytes += addrsz;
		if ((flags & spi_addrlsb) == 0) {
			uint32_t addr_swapped = bswap_32((uint32_t)addr);
			addr = addr_swapped >> ((4 - addrsz) * 8);
		}

		for (unsigned int i = 0; i < addrsz; i++) {
			*(ctx->base + spi_txdr) = addr;
			addr >>= 8;
		}
	}

	if ((flags & spi_dummy) != 0) {
		ignoreBytes += 1;
		*(ctx->base + spi_txdr) = addr;
	}

	while (ignoreBytes != 0) {
		while ((*(ctx->base + spi_sr) & SR_RXP) == 0) {
			/* Wait for a packet to arrive */
		}

		(void)*(ctx->base + spi_rxdr);
		ignoreBytes--;
	}

	for (size_t i = 0; i < bufflen; i++) {
		while ((*(ctx->base + spi_sr) & SR_TXP) == 0) {
			/* Wait for space in the FIFO */
		}

		if (dir != spi_dir_read) {
			*(ctx->base + spi_txdr) = obuff[i];
		}
		else {
			*(ctx->base + spi_txdr) = 0;
		}

		while ((*(ctx->base + spi_sr) & SR_RXP) == 0) {
			/* Wait a packet to arrive */
		}

		if (dir != spi_dir_write) {
			ibuff[i] = *(ctx->base + spi_rxdr);
		}
		else {
			(void)*(ctx->base + spi_rxdr);
		}
	}

	while ((*(ctx->base + spi_sr) & SR_TXC) == 0) {
		/* Wait for transmission to complete */
	}

	/* Disable SPI */
	dataBarier();
	*(ctx->base + spi_cr1) &= ~1;
	dataBarier();

	return bufflen;
}


int libspi_configure(libspi_ctx_t *ctx, char mode, char bdiv, int enable)
{
	uint32_t v;

	devClk(spiInfo[ctx->spiNum - spi1].dev, 1);
	*(ctx->base + spi_cr1) &= ~1;
	dataBarier();

	uint32_t bdiv_bits = ((((uint32_t)bdiv) & 0x3) << 28);
	uint32_t dma_bits = (ctx->per != NULL) ? (0x3 << 14) : 0; /* Enable TX and RX DMA */
	v = *(ctx->base + spi_cfg1);
	v &= ~0xf05fc3ff;
	v |=
			bdiv_bits | /* Baud rate divider */
			(0 << 22) | /* CRC calculation disabled */
			(0 << 16) | /* CRC not used */
			dma_bits |  /* DMA mode */
			(0 << 9) |  /* In case of underrun, send repeated pattern */
			(7 << 5) |  /* FIFO threshold - 8 frames (8 bytes) */
			(7 << 0);   /* Data size (8 bits) */
	*(ctx->base + spi_cfg1) = v;

	uint32_t mode_bits = ((((uint32_t)mode) & 0x3) << 24);
	v = *(ctx->base + spi_cfg2);
	v &= ~0xf7fee0ff;
	v =
			(0 << 31) | /* SPI peripheral releases GPIOs when disabled */
			(1 << 29) | /* SS output enable */
			(0 << 28) | /* SS active low */
			mode_bits | /* SPI polarity and phase */
			(0 << 23) | /* MSB first */
			(1 << 22) | /* Master mode */
			(0 << 19) | /* SPI Motorola */
			(0 << 17) | /* Full duplex */
			(0 << 15) | /* No I/O swap */
			(0 << 13) | /* RDY signal not used */
			(0 << 4) |  /* No inter-data delay */
			(0 << 0);   /* No SS delay */
	*(ctx->base + spi_cfg2) = v;

	*(ctx->base + spi_udrdr) = 0;     /* Underrun data pattern - all 0s */
	*(ctx->base + spi_i2scfgr) &= ~1; /* Disable I2S mode */

	if (enable == 0) {
		devClk(spiInfo[ctx->spiNum - spi1].dev, 0);
	}

	return EOK;
}


int libspi_init(libspi_ctx_t *ctx, unsigned int spi, int useDma)
{
	if ((spi < spi1) || (spi > MAX_SPI) || (ctx == NULL)) {
		return -1;
	}

	ctx->base = (void *)spiInfo[spi - spi1].base;
	if (rcc_setClksel(spiInfo[spi - spi1].clksel, spiInfo[spi - spi1].clksrc) < 0) {
		return -1;
	}

	if (useDma != 0) {
		/* TODO: support DMA transfers */
		return -1;
	}
	else {
		ctx->per = NULL;
	}

	return libspi_configure(ctx, 0, 0, 1);
}
